<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"8708624c31d7015b702ebf16d7b4f34c1ee719969bce42339e81597f0cceefcc","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #950 at https://github.com/cal-itp/data-infra/actions/runs/19241144527","plan_out_hash":"c435dfc89ab2e02fc8afc64becfc7c930045612c7176c19786f7e03e7c9d82a1","plan_hash":"23bb3f4060ccd12e85446148d18aa0140d68cc52415da0b50ca53d90e41887e7","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 4 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/create_external_tables/ntd_data_products/2024__annual_database_agency_information.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/create_external_tables/ntd_data_products/2024__annual_database_agency_information.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/create_external_tables/ntd_data_products/2024__annual_database_agency_information.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/create_external_tables/ntd_data_products/2024__annual_database_contractual_relationships.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/create_external_tables/ntd_data_products/2024__annual_database_contractual_relationships.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/create_external_tables/ntd_data_products/2024__annual_database_contractual_relationships.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/gcs_to_ckan_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "c+Z80g==" -> (known after apply)
!~      detect_md5hash      = "Hqxqo1tsVzYlSOtfh/RU7A==" -> "different hash"
!~      generation          = 1762797518747450 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/gcs_to_ckan_operator.py"
!~      md5hash             = "Hqxqo1tsVzYlSOtfh/RU7A==" -> (known after apply)
        name                = "plugins/operators/gcs_to_ckan_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/ntd_annual_reporting/_src.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "VU39NA==" -> (known after apply)
!~      detect_md5hash      = "ipjE1mifzCdzNFwXs7YZ6Q==" -> "different hash"
!~      generation          = 1762295803375743 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/ntd_annual_reporting/_src.yml"
!~      md5hash             = "ipjE1mifzCdzNFwXs7YZ6Q==" -> (known after apply)
        name                = "data/warehouse/models/staging/ntd_annual_reporting/_src.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/ntd_annual_reporting/_stg_ntd_annual_reporting.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "GykjiA==" -> (known after apply)
!~      detect_md5hash      = "wmZ4b8VMSVWZoXI24Ojpxw==" -> "different hash"
!~      generation          = 1762295803149278 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/ntd_annual_reporting/_stg_ntd_annual_reporting.yml"
!~      md5hash             = "wmZ4b8VMSVWZoXI24Ojpxw==" -> (known after apply)
        name                = "data/warehouse/models/staging/ntd_annual_reporting/_stg_ntd_annual_reporting.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/ntd_annual_reporting/stg_ntd__2024_agency_information.sql"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/models/staging/ntd_annual_reporting/stg_ntd__2024_agency_information.sql"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/models/staging/ntd_annual_reporting/stg_ntd__2024_agency_information.sql"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/ntd_annual_reporting/stg_ntd__2024_contractual_relationships.sql"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/models/staging/ntd_annual_reporting/stg_ntd__2024_contractual_relationships.sql"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/models/staging/ntd_annual_reporting/stg_ntd__2024_contractual_relationships.sql"
+       storage_class  = (known after apply)
    }

Plan: 4 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #950](https://github.com/cal-itp/data-infra/actions/runs/19241144527)